{
  "format": "layers-model",
  "generatedBy": "custom-tflite-extractor",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "2.9.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                42
              ],
              "dtype": "float32",
              "name": "input_1"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "mish_4",
              "trainable": true,
              "dtype": "float32",
              "activation": "mish"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "mish_5",
              "trainable": true,
              "dtype": "float32",
              "activation": "mish"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_6",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "mish_6",
              "trainable": true,
              "dtype": "float32",
              "activation": "mish"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "dtype": "float32",
              "units": 26,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {}
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              }
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense_4/kernel",
          "shape": [
            42,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_4/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_5/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_6/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_6/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/kernel",
          "shape": [
            32,
            26
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/bias",
          "shape": [
            26
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}